// 일기 전체 조회

const mockdata = 
{
    "content": [
      {
        "id": null,
        "title": "A beautiful day",
        "content": "Today I went for a walk and enjoyed the sunny weather...",
        "userDto": {
          "id": 1,
          "loginId": "user@example.com",
          "password": "{bcrypt}$2a$10$R0E8hz66IF3nlpM5ADsbyeCfqsk7Cgo81z2jvzbRwHHBj/qh0zfsC",
          "birthDate": "1990-01-01",
          "nickname": "john_doe",
          "role": "USER",
          "createdAt": "2024-09-05T20:48:37.274388"
        },
        "happiness": 75,
        "weather": 701,
        "vectorImage": "data:image/svg+xml;base64,...",
        "template": "DEFAULT",
        "rType": "P, 50, 평온형은 휴식과 재충전의 중요성을 이해하며, 일상에서 여유를 찾아냅니다. 스트레스와 부담을 피하고, 평온한 환경에서 안정감을 찾아냅니다. 평온형은 일과 삶의 균형을 유지하며, 재충전의 시간을 통해 내면의 평온함을 유지하고 스트레스를 해소합니다. 이 유형은 여유로운 시간을 통해 자신의 감정과 생각을 정리하며, 안정된 상태에서 삶의 목표와 꿈을 추구합니다.",
        "jType": "H, 75, 긍정형은 일상과 다양한 상황에서 긍정적인 감정과 기쁨을 찾아냅니다. 사건이나 사람들과의 상호작용에서 긍정적인 감정을 많이 느끼며, 이를 통해 삶의 만족도를 높여나갑니다. 긍정형은 상황을 긍정적으로 해석하고, 좋은 면을 찾아내며, 이를 통해 삶의 풍요로움과 즐거움을 느낍니다.",
        "mType": "D, 25, 주도형은 높은 동기부여를 가지고 목표를 향해 나아가며, 뚜렷한 목표가 있고 그것을 달성하기 위해 지속적인 노력을 기울입니다. 이 유형은 목표 지향적이며, 자신의 목표와 꿈을 이루기 위해 노력하고 도전합니다. 주도형은 자신의 능력과 자원을 최대한 활용하여 목표 달성을 위해 전진합니다.",
        "dType": "C, 50, 차분형은 방해나 문제에 대해 유연하게 대처하는 능력이 있으며, 문제나 장애요소들이 생겨도 차분하게 문제 해결 능력을 발휘합니다. 이 유형은 냉정하고 차분한 태도로 상황을 진단하며, 구조적이고 논리적인 방식으로 문제를 해결합니다. 차분형은 이성적이며, 감정의 파동에 휘둘리지 않고 상황을 청명하게 이해하며 대응합니다.",
        "totalDesc": "이 유형의 일기는 평온한 분위기 속에서 목표를 향해 차분하게 나아가는 과정을 담고 있습니다. 긍정적인 감정은 목표 달성의 여정 속에서 뚜렷하게 드러나며, 글쓴이는 이러한 과정을 통해 개인의 성장과 발전을 경험합니다. 해질녘의 평온함처럼, 일기는 글쓴이의 차분하고 꾸준한 노력을 보여줍니다.",
        "totalTitle": "평온한 해질녘의 추구",
        "createdAt": "2024-09-05T22:33:05.850615"
      },
      {
        "id": null,
        "title": "A beautiful day",
        "content": "Today I went for a walk and enjoyed the sunny weather...",
        "userDto": {
          "id": 1,
          "loginId": "user@example.com",
          "password": "{bcrypt}$2a$10$R0E8hz66IF3nlpM5ADsbyeCfqsk7Cgo81z2jvzbRwHHBj/qh0zfsC",
          "birthDate": "1990-01-01",
          "nickname": "john_doe",
          "role": "USER",
          "createdAt": "2024-09-05T20:48:37.274388"
        },
        "happiness": 75,
        "weather": 701,
        "vectorImage": "data:image/svg+xml;base64,...",
        "template": "DEFAULT",
        "rType": "P, 50, 평온형은 휴식과 재충전의 중요성을 이해하며, 일상에서 여유를 찾아냅니다. 스트레스와 부담을 피하고, 평온한 환경에서 안정감을 찾아냅니다. 평온형은 일과 삶의 균형을 유지하며, 재충전의 시간을 통해 내면의 평온함을 유지하고 스트레스를 해소합니다. 이 유형은 여유로운 시간을 통해 자신의 감정과 생각을 정리하며, 안정된 상태에서 삶의 목표와 꿈을 추구합니다.",
        "jType": "H, 75, 긍정형은 일상과 다양한 상황에서 긍정적인 감정과 기쁨을 찾아냅니다. 사건이나 사람들과의 상호작용에서 긍정적인 감정을 많이 느끼며, 이를 통해 삶의 만족도를 높여나갑니다. 긍정형은 상황을 긍정적으로 해석하고, 좋은 면을 찾아내며, 이를 통해 삶의 풍요로움과 즐거움을 느낍니다.",
        "mType": "D, 25, 주도형은 높은 동기부여를 가지고 목표를 향해 나아가며, 뚜렷한 목표가 있고 그것을 달성하기 위해 지속적인 노력을 기울입니다. 이 유형은 목표 지향적이며, 자신의 목표와 꿈을 이루기 위해 노력하고 도전합니다. 주도형은 자신의 능력과 자원을 최대한 활용하여 목표 달성을 위해 전진합니다.",
        "dType": "C, 50, 차분형은 방해나 문제에 대해 유연하게 대처하는 능력이 있으며, 문제나 장애요소들이 생겨도 차분하게 문제 해결 능력을 발휘합니다. 이 유형은 냉정하고 차분한 태도로 상황을 진단하며, 구조적이고 논리적인 방식으로 문제를 해결합니다. 차분형은 이성적이며, 감정의 파동에 휘둘리지 않고 상황을 청명하게 이해하며 대응합니다.",
        "totalDesc": "이 유형의 일기는 평온한 분위기 속에서 목표를 향해 차분하게 나아가는 과정을 담고 있습니다. 긍정적인 감정은 목표 달성의 여정 속에서 뚜렷하게 드러나며, 글쓴이는 이러한 과정을 통해 개인의 성장과 발전을 경험합니다. 해질녘의 평온함처럼, 일기는 글쓴이의 차분하고 꾸준한 노력을 보여줍니다.",
        "totalTitle": "평온한 해질녘의 추구",
        "createdAt": "2024-09-05T22:33:05.850615"
      },
      {
        "id": null,
        "title": "A beautiful day",
        "content": "Today I went for a walk and enjoyed the sunny weather...",
        "userDto": {
          "id": 1,
          "loginId": "user@example.com",
          "password": "{bcrypt}$2a$10$R0E8hz66IF3nlpM5ADsbyeCfqsk7Cgo81z2jvzbRwHHBj/qh0zfsC",
          "birthDate": "1990-01-01",
          "nickname": "john_doe",
          "role": "USER",
          "createdAt": "2024-09-05T20:48:37.274388"
        },
        "happiness": 75,
        "weather": 701,
        "vectorImage": "data:image/svg+xml;base64,...",
        "template": "DEFAULT",
        "rType": "P, 50, 평온형은 휴식과 재충전의 중요성을 이해하며, 일상에서 여유를 찾아냅니다. 스트레스와 부담을 피하고, 평온한 환경에서 안정감을 찾아냅니다. 평온형은 일과 삶의 균형을 유지하며, 재충전의 시간을 통해 내면의 평온함을 유지하고 스트레스를 해소합니다. 이 유형은 여유로운 시간을 통해 자신의 감정과 생각을 정리하며, 안정된 상태에서 삶의 목표와 꿈을 추구합니다.",
        "jType": "H, 75, 긍정형은 일상과 다양한 상황에서 긍정적인 감정과 기쁨을 찾아냅니다. 사건이나 사람들과의 상호작용에서 긍정적인 감정을 많이 느끼며, 이를 통해 삶의 만족도를 높여나갑니다. 긍정형은 상황을 긍정적으로 해석하고, 좋은 면을 찾아내며, 이를 통해 삶의 풍요로움과 즐거움을 느낍니다.",
        "mType": "D, 25, 주도형은 높은 동기부여를 가지고 목표를 향해 나아가며, 뚜렷한 목표가 있고 그것을 달성하기 위해 지속적인 노력을 기울입니다. 이 유형은 목표 지향적이며, 자신의 목표와 꿈을 이루기 위해 노력하고 도전합니다. 주도형은 자신의 능력과 자원을 최대한 활용하여 목표 달성을 위해 전진합니다.",
        "dType": "C, 50, 차분형은 방해나 문제에 대해 유연하게 대처하는 능력이 있으며, 문제나 장애요소들이 생겨도 차분하게 문제 해결 능력을 발휘합니다. 이 유형은 냉정하고 차분한 태도로 상황을 진단하며, 구조적이고 논리적인 방식으로 문제를 해결합니다. 차분형은 이성적이며, 감정의 파동에 휘둘리지 않고 상황을 청명하게 이해하며 대응합니다.",
        "totalDesc": "이 유형의 일기는 평온한 분위기 속에서 목표를 향해 차분하게 나아가는 과정을 담고 있습니다. 긍정적인 감정은 목표 달성의 여정 속에서 뚜렷하게 드러나며, 글쓴이는 이러한 과정을 통해 개인의 성장과 발전을 경험합니다. 해질녘의 평온함처럼, 일기는 글쓴이의 차분하고 꾸준한 노력을 보여줍니다.",
        "totalTitle": "평온한 해질녘의 추구",
        "createdAt": "2024-09-05T22:33:05.850615"
      },
      {
        "id": null,
        "title": "A beautiful day",
        "content": "Today I went for a walk and enjoyed the sunny weather...",
        "userDto": {
          "id": 1,
          "loginId": "user@example.com",
          "password": "{bcrypt}$2a$10$R0E8hz66IF3nlpM5ADsbyeCfqsk7Cgo81z2jvzbRwHHBj/qh0zfsC",
          "birthDate": "1990-01-01",
          "nickname": "john_doe",
          "role": "USER",
          "createdAt": "2024-09-05T20:48:37.274388"
        },
        "happiness": 75,
        "weather": 701,
        "vectorImage": "data:image/svg+xml;base64,...",
        "template": "DEFAULT",
        "rType": "P, 50, 평온형은 휴식과 재충전의 중요성을 이해하며, 일상에서 여유를 찾아냅니다. 스트레스와 부담을 피하고, 평온한 환경에서 안정감을 찾아냅니다. 평온형은 일과 삶의 균형을 유지하며, 재충전의 시간을 통해 내면의 평온함을 유지하고 스트레스를 해소합니다. 이 유형은 여유로운 시간을 통해 자신의 감정과 생각을 정리하며, 안정된 상태에서 삶의 목표와 꿈을 추구합니다.",
        "jType": "H, 75, 긍정형은 일상과 다양한 상황에서 긍정적인 감정과 기쁨을 찾아냅니다. 사건이나 사람들과의 상호작용에서 긍정적인 감정을 많이 느끼며, 이를 통해 삶의 만족도를 높여나갑니다. 긍정형은 상황을 긍정적으로 해석하고, 좋은 면을 찾아내며, 이를 통해 삶의 풍요로움과 즐거움을 느낍니다.",
        "mType": "D, 25, 주도형은 높은 동기부여를 가지고 목표를 향해 나아가며, 뚜렷한 목표가 있고 그것을 달성하기 위해 지속적인 노력을 기울입니다. 이 유형은 목표 지향적이며, 자신의 목표와 꿈을 이루기 위해 노력하고 도전합니다. 주도형은 자신의 능력과 자원을 최대한 활용하여 목표 달성을 위해 전진합니다.",
        "dType": "C, 50, 차분형은 방해나 문제에 대해 유연하게 대처하는 능력이 있으며, 문제나 장애요소들이 생겨도 차분하게 문제 해결 능력을 발휘합니다. 이 유형은 냉정하고 차분한 태도로 상황을 진단하며, 구조적이고 논리적인 방식으로 문제를 해결합니다. 차분형은 이성적이며, 감정의 파동에 휘둘리지 않고 상황을 청명하게 이해하며 대응합니다.",
        "totalDesc": "이 유형의 일기는 평온한 분위기 속에서 목표를 향해 차분하게 나아가는 과정을 담고 있습니다. 긍정적인 감정은 목표 달성의 여정 속에서 뚜렷하게 드러나며, 글쓴이는 이러한 과정을 통해 개인의 성장과 발전을 경험합니다. 해질녘의 평온함처럼, 일기는 글쓴이의 차분하고 꾸준한 노력을 보여줍니다.",
        "totalTitle": "평온한 해질녘의 추구",
        "createdAt": "2024-09-05T22:33:05.850615"
      },
      {
        "id": null,
        "title": "A beautiful day",
        "content": "Today I went for a walk and enjoyed the sunny weather...",
        "userDto": {
          "id": 1,
          "loginId": "user@example.com",
          "password": "{bcrypt}$2a$10$R0E8hz66IF3nlpM5ADsbyeCfqsk7Cgo81z2jvzbRwHHBj/qh0zfsC",
          "birthDate": "1990-01-01",
          "nickname": "john_doe",
          "role": "USER",
          "createdAt": "2024-09-05T20:48:37.274388"
        },
        "happiness": 75,
        "weather": 701,
        "vectorImage": "data:image/svg+xml;base64,...",
        "template": "DEFAULT",
        "rType": "P, 50, 평온형은 휴식과 재충전의 중요성을 이해하며, 일상에서 여유를 찾아냅니다. 스트레스와 부담을 피하고, 평온한 환경에서 안정감을 찾아냅니다. 평온형은 일과 삶의 균형을 유지하며, 재충전의 시간을 통해 내면의 평온함을 유지하고 스트레스를 해소합니다. 이 유형은 여유로운 시간을 통해 자신의 감정과 생각을 정리하며, 안정된 상태에서 삶의 목표와 꿈을 추구합니다.",
        "jType": "H, 75, 긍정형은 일상과 다양한 상황에서 긍정적인 감정과 기쁨을 찾아냅니다. 사건이나 사람들과의 상호작용에서 긍정적인 감정을 많이 느끼며, 이를 통해 삶의 만족도를 높여나갑니다. 긍정형은 상황을 긍정적으로 해석하고, 좋은 면을 찾아내며, 이를 통해 삶의 풍요로움과 즐거움을 느낍니다.",
        "mType": "D, 25, 주도형은 높은 동기부여를 가지고 목표를 향해 나아가며, 뚜렷한 목표가 있고 그것을 달성하기 위해 지속적인 노력을 기울입니다. 이 유형은 목표 지향적이며, 자신의 목표와 꿈을 이루기 위해 노력하고 도전합니다. 주도형은 자신의 능력과 자원을 최대한 활용하여 목표 달성을 위해 전진합니다.",
        "dType": "C, 50, 차분형은 방해나 문제에 대해 유연하게 대처하는 능력이 있으며, 문제나 장애요소들이 생겨도 차분하게 문제 해결 능력을 발휘합니다. 이 유형은 냉정하고 차분한 태도로 상황을 진단하며, 구조적이고 논리적인 방식으로 문제를 해결합니다. 차분형은 이성적이며, 감정의 파동에 휘둘리지 않고 상황을 청명하게 이해하며 대응합니다.",
        "totalDesc": "이 유형의 일기는 평온한 분위기 속에서 목표를 향해 차분하게 나아가는 과정을 담고 있습니다. 긍정적인 감정은 목표 달성의 여정 속에서 뚜렷하게 드러나며, 글쓴이는 이러한 과정을 통해 개인의 성장과 발전을 경험합니다. 해질녘의 평온함처럼, 일기는 글쓴이의 차분하고 꾸준한 노력을 보여줍니다.",
        "totalTitle": "평온한 해질녘의 추구",
        "createdAt": "2024-09-05T22:33:05.850615"
      }
    ],
    "pageable": {
      "pageNumber": 0,
      "pageSize": 10,
      "sort": {
        "empty": false,
        "sorted": true,
        "unsorted": false
      },
      "offset": 0,
      "paged": true,
      "unpaged": false
    },
    "last": true,
    "totalElements": 5,
    "totalPages": 1,
    "first": true,
    "size": 10,
    "number": 0,
    "sort": {
      "empty": false,
      "sorted": true,
      "unsorted": false
    },
    "numberOfElements": 5,
    "empty": false
  }

  export default mockdata;